In [1]:
# TO IMPORT A CSV FILE 
import pandas as pd
df=pd.read_csv('customers.csv')
df

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [2]:
df.shape

(5, 4)

In [3]:
df.head()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [4]:
df.tail(2)

   CustomerID   Name   Age     City
3           4  David   NaN  Chicago
4           5    Eve  45.0  Houston

In [5]:
df.columns

Index(['CustomerID', 'Name', 'Age', 'City'], dtype='object')

In [6]:
df.describe()

       CustomerID        Age
count    5.000000   4.000000
mean     3.000000  33.750000
std      1.581139   8.539126
min      1.000000  25.000000
25%      2.000000  28.750000
50%      3.000000  32.500000
75%      4.000000  37.500000
max      5.000000  45.000000

In [25]:
df.info

<bound method DataFrame.info of    CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston>

In [26]:
df.isnull()

   CustomerID   Name    Age   City
0       False  False  False  False
1       False  False  False  False
2       False  False  False   True
3       False  False   True  False
4       False  False  False  False

In [7]:
df[df['Age']==df['Age'].max()]

   CustomerID Name   Age     City
4           5  Eve  45.0  Houston

In [8]:
type[df['Name']]

type[0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object]

In [9]:
df[['CustomerID','Name']]

   CustomerID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David
4           5      Eve

In [10]:
df['CustomerID'][df['Age']==45]   #displays the customerid where age==45

4    5
Name: CustomerID, dtype: int64

In [11]:
df[df['Name']=='Charlie']

   CustomerID     Name   Age City
2           3  Charlie  35.0  NaN

In [12]:
df[df['Age']>=30]

   CustomerID     Name   Age         City
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
4           5      Eve  45.0      Houston

In [13]:
df['Age'].max()

45.0

In [14]:
df['Age'].min()

25.0

In [15]:
newdf=df.dropna(axis=0)
newdf

   CustomerID   Name   Age         City
0           1  Alice  25.0     New York
1           2    Bob  30.0  Los Angeles
4           5    Eve  45.0      Houston

In [16]:
newdf=df.dropna(axis=1)
newdf

   CustomerID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David
4           5      Eve

In [30]:
newdf=df.fillna(0)   #fills the entire dataset with 0 where we have NaN value
newdf

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0            0
3           4    David   0.0      Chicago
4           5      Eve  45.0      Houston

In [17]:
newdf=df.fillna(df['Age'].max())   #fills the entire dataset with 0 where we have NaN value
newdf

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0         45.0
3           4    David  45.0      Chicago
4           5      Eve  45.0      Houston

In [18]:
newdf=df.fillna({
    'Age':0,
    'City':'Not given'
    
})
newdf

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0    Not given
3           4    David   0.0      Chicago
4           5      Eve  45.0      Houston

In [32]:
newdf=df.fillna(method='ffill')
newdf

C:\Users\kapul\AppData\Local\Temp\ipykernel_29800\1075770654.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  newdf=df.fillna(method='ffill')

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0  Los Angeles
3           4    David  35.0      Chicago
4           5      Eve  45.0      Houston

In [33]:
newdf=df.fillna(method='bfill')
newdf

C:\Users\kapul\AppData\Local\Temp\ipykernel_29800\1920324291.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  newdf=df.fillna(method='bfill')

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0      Chicago
3           4    David  45.0      Chicago
4           5      Eve  45.0      Houston

In [38]:
newdf=df.interpolate()
newdf

C:\Users\kapul\AppData\Local\Temp\ipykernel_29800\2712138379.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  newdf=df.interpolate()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David  40.0      Chicago
4           5      Eve  45.0      Houston

In [23]:
newdf['additionalcol']=df['CustomerID']+df['Age']
newdf
newdf.fillna(df['CustomerID'].max())

   CustomerID     Name   Age         City  additionalcol
0           1    Alice  25.0     New York           26.0
1           2      Bob  30.0  Los Angeles           32.0
2           3  Charlie  35.0    Not given           38.0
3           4    David   0.0      Chicago            5.0
4           5      Eve  45.0      Houston           50.0

In [24]:
df['Age'].sum()

135.0

In [22]:
groupeddf=newdf.groupby("City")
groupeddf

In [123]:
for City,data in groupeddf:
    print("city :",City)
    print("\n")
    print("data:",data)

city : Chicago


data:    CustomerID     Name   Age     City
2           3  Charlie  35.0  Chicago
3           4    David  45.0  Chicago
city : Houston


data:    CustomerID Name   Age     City
4           5  Eve  45.0  Houston
city : Los Angeles


data:    CustomerID Name   Age         City
1           2  Bob  30.0  Los Angeles
city : New York


data:    CustomerID   Name   Age      City
0           1  Alice  25.0  New York

In [124]:
groupeddf.get_group('Chicago')

   CustomerID     Name   Age     City
2           3  Charlie  35.0  Chicago
3           4    David  45.0  Chicago